# name = 'Бийке-Ханум'
# age = 18

# print('Привет! Меня зовут ' +  name + ', мне ' + str(age) + ' лет.')

# format
# print('Привет! Меня зовут {}, мне {} лет.'.format(name, age))
# print(f'Привет! Меня зовут {name}, мне {age} лет.')

# age = int(input('Сколько Вам лет? '))
#
# if age >= 18:
#     print('Добро пожаловать!')
# else:
#     print(f'Как подрастешь, приходи! А так, тебе не хватает {18 - age} лет.')

# age = int(input('Сколько Вам лет? '))
#
# if age >= 18:
#     print('Добро пожаловать!')
# else:
#     print(f'Как подрастешь, приходи! А так, тебе не хватает {18 - age} лет.')
#
# name = input('А как тебя зовут? ')
# print(f'Круто, {name}!')

