# verse = 'Город зимнее снял.\n\
# Снега распустили слюнки.\n\
# Опять пришла весна,\n\
# глупа и болтлива, как юнкер.'
#
# print(verse)
#
# verse = 'Город зимнее снял.\n' \
#         'Снега распустили слюнки.\n' \
#         'Опять пришла весна,\n' \
#         'лупа и болтлива, как юнкер.\n'
#
# print(verse)

# verse = ('Город зимнее снял.\n'
#         'Снега распустили слюнки.\n'
#         'Опять пришла весна,\n'
#         'лупа и болтлива, как юнкер.\n')
#
# print(verse)

# verse = '''Город зимнее снял.
# Снега распустили слюнки.
# Опять пришла весна,
# лупа и болтлива, как юнкер.'''
#
# print(verse)

